NamJeongkuk/ref_main/src/mini-rx62t/Hardware/Flash/r_flash_group.c
/***********************************************************************************************************************
 * Function Name: flash_interrupt_config
 * Description  : Function to enable of disable flash interrupts.
 * Arguments    : state -
 *                    true:  Enable Interrupts (BGO mode)
 *                    false: Disable interrupts (non-BGO mode)
 *               *pCallback -
 *                    Callback function called from ISR after operation completes (unused if state = false).
 * Return Value : FLASH_SUCCESS -
 *                    Interrupts configured successfully.
 *                FLASH_ERR_NULL_PTR -
 *                    Invalid callback function pointer passed when enabling interrupts
 ***********************************************************************************************************************/
flash_err_t flash_interrupt_config(bool state, void *pcfg)
{
    flash_interrupt_config_t *int_cfg = pcfg;

    if (true == state)
    {
#if (FLASH_CFG_PARAM_CHECKING_ENABLE == 1)
        if ((int_cfg->int_priority < 1) || (int_cfg->int_priority > 15))
        {
            return FLASH_ERR_PARAM;
        }

        if ((NULL == int_cfg->pcallback) || (FIT_NO_FUNC == int_cfg->pcallback))
        {
            return FLASH_ERR_NULL_PTR;
        }
#endif
        /* Assign the callback if not NULL*/
        flash_ready_isr_handler = int_cfg->pcallback;
        flash_error_isr_handler = int_cfg->pcallback;

        /* Enable interrupts in FCU */
        FLASH_FCU_INT_ENABLE;

        /* Enable interrupts in ICU */
        IR(FCU,FRDYI)= 0;                           // Clear Flash Ready Interrupt Request
        IPR(FCU,FRDYI)= int_cfg->int_priority;      // Set Flash Ready Interrupt Priority
        IEN (FCU,FRDYI)= 1;                         // Enable Flash Ready Interrupt

#ifdef FLASH_HAS_ERR_ISR
        IR(FCU,FIFERR)= 0;                          // Clear Flash Error Interrupt Request
        IPR(FCU,FIFERR)= int_cfg->int_priority;     // Set Flash Error Interrupt Priority
        IEN (FCU,FIFERR)= 1;                        // Enable Flash Error Interrupt
#endif
    }

    else if (false == state)
    {
        /* Disable interrupts in FCU */
        FLASH_FCU_INT_DISABLE;

        /* Disable interrupts in MCU */
        IR(FCU,FRDYI) = 0;                          // Clear any pending Flash Ready Interrupt Request
#ifdef FLASH_HAS_ERR_ISR
        IR(FCU,FIFERR) = 0;                         // Clear any pending Flash Error Interrupt Request
#endif
    }
    else
    {
        return FLASH_ERR_PARAM;
    }

    return FLASH_SUCCESS;
}


/***********************************************************************************************************************
* Function Name: r_flash_close
* Description  : Function disables flash interrupts and marks driver as closed.
* Arguments    : void
* Return Value : FLASH_SUCCESS -
*                    API closed successfully.
*                FLASH_ERR_BUSY -
*                    Another operation is ongoing.
***********************************************************************************************************************/
flash_err_t r_flash_close(void)
{

    /* Lock driver */
    if (FLASH_SUCCESS != flash_lock_state(FLASH_UNINITIALIZED))
    {
        return FLASH_ERR_BUSY;
    }

    /* Disable interrupts */
    flash_interrupt_config(false, NULL);

    /* Show driver as closed and release hold on lock.
     * Do not use flash_release_state() because we do not want to set state to FLASH_READY.
     */
    g_driver_opened = false;
    flash_softwareUnlock(&g_flash_lock);

    return FLASH_SUCCESS;
}


/***********************************************************************************************************************
* Function Name: set_non_cached_regs
* Description  : This function sets the NCRGx and NCRCx registers to configure non-cached ROM ranges.
* Arguments    : p_cfg
*                    Pointer to non-cached range info.
*                p_regs -
*                    Pointer to registers to write to.
* Return Value : FLASH_SUCCESS -
*                    Range set successfully.
*                FLASH_ERR_PARAM -
*                    One of the arguments within the p_cfg structure was invalid.
***********************************************************************************************************************/
#if (FLASH_HAS_NON_CACHED_RANGES && FLASH_CFG_CODE_FLASH_ENABLE)
static flash_err_t set_non_cached_regs(flash_non_cached_t *p_cfg, flash_non_cached_regs_t *p_regs)
{
    flash_err_t err = FLASH_SUCCESS;
    uint32_t    size_reg_value;
    uint8_t     caching_was_enabled;

#if FLASH_CFG_PARAM_CHECKING_ENABLE
    if (((p_cfg->start_addr & 0xF) != 0)                        // address not on 16-byte boundary
     || ((p_cfg->start_addr & 0xFFC00000) != 0xFFC00000)        // address not ROM address
     || (p_cfg->size < FLASH_NON_CACHED_16_BYTES)               // size less than minimum 16 bytes
     || (p_cfg->size > MCU_ROM_SIZE_BYTES)                      // size greater than ROM size
     || ((-p_cfg->size & p_cfg->size) != p_cfg->size)           // size not power of 2 (check for more than 1 bit set)
     || ((p_cfg->start_addr + p_cfg->size) <= (uint32_t)FLASH_CF_BLOCK_INVALID) // area goes past end of ROM
     || ((p_cfg->type_mask & ~FLASH_NON_CACHED_MASK) != 0))     // unknown flag set
    {
        return FLASH_ERR_PARAM;
    }
#endif

    /* save current cache enable state and disable caching */
    caching_was_enabled = FLASH.ROMCE.BIT.ROMCEN;
    FLASH.ROMCE.BIT.ROMCEN = 0;

    /* set non-cached start address */
    p_regs->ncrg = p_cfg->start_addr;

    /* set non-cached size */
    size_reg_value = (p_cfg->size - 1) >> 4;
    p_regs->ncrc.BIT.NCSZ = (uint16_t) size_reg_value;

    /* clear previous type flags and set new ones */
    p_regs->ncrc.LONG &= ~FLASH_NON_CACHED_MASK;
    p_regs->ncrc.LONG |= p_cfg->type_mask;

